app/controllers/sessions_controller.rb

 def create
  id = params[:user][:user_id]
  @user_db = User.find_by_user_id(id)
---
SELECT "users".* FROM "users" WHERE "users"."user_id" = 111 LIMIT 1