app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_id" = 'user_id' LIMIT 1
SELECT 1 AS one FROM "users" WHERE "users"."user_id" IS NULL LIMIT 1
INSERT INTO "users" ("created_at", "email", "session_token", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 06 Oct 2013 00:00:38 UTC +00:00], ["email", nil], ["session_token", nil], ["updated_at", Sun, 06 Oct 2013 00:00:38 UTC +00:00], ["user_id", nil]]
---
def create
 id = params[:user][:user_id]
 if User.exists?(:user_id => id)
  flash[:notice] = "Sorry. This user-id is already taken. Try again."
  redirect_to new_user_path
 else
  @userm = User.user_create!(params[:user])
  @user = User.create!(@userm)